## Python Libraries - Pandas - Merge and Append

In this section, you will merge and concatenate multiple dataframes. Merging is one of the most common operations you will do, since data often comes in various files.

### Merging

For merging, we have sales data across multiple sheets in an Excel file. We will now work with all these sheets and learn to:
* Merge multiple dataframes using common columns/keys using ```pd.merge()```

Let's first read all the data files.

In [1]:
# import the required libraries

In [19]:
# read the sheets from file 'sales_returns.xlsx' into 2 different dataframes - orders and returns
orders = 
returns =

In [ ]:
# Check the shape of the dataframe 'orders'

In [ ]:
# Check the shape of the dataframe 'returns'

In [2]:
# check the dataframe 'orders' and 'returns'

In [ ]:
# Create a dataframe 'return_orders' by merging the two dataframes on Order_ID


# Check the created dataframe

In [6]:
# Check the shape of the new dataframe
sum(2,3)

TypeError: 'int' object is not iterable

In [ ]:
# try to use the 'left' method to join two dataframes


# Check the created dataframe

In [ ]:
# Check the orders where orders were returned

In [ ]:
# Print the dataframe summary using the info() command

In [ ]:
# Change the data type of the column 'Returned' 


# Check the dataframe after modification

In [ ]:
# Replace the 'nan' value with 'No' in the column 'Returned'


# Check the dataframe after modification

### Append / Concatenate

Concatenation is much more straightforward than merging. It is used when you have dataframes having the same columns and want to append them (pile one on top of the other), or having the same rows and want to append them side-by-side.

In [ ]:
# Import the required libraries

**Appending rows in a dataframe**

In [2]:
# Dataframes having the same columns
import pandas as pd

df1 = pd.DataFrame({'Name': ['Aman', 'Joy', 'Rashmi', 'Saif'],
                    'Age' : ['34', '31', '22', '33'], 
                    'Gender': ['M', 'M', 'F', 'M']}
                  )

df2 = pd.DataFrame({'Name': ['Akhil', 'Asha', 'Preeti'],
                    'Age' : ['31', '22', '23'], 
                    'Gender': ['M', 'F', 'F']}
                  )

In [19]:
# Append the rows of df2 in df1
# df3=df1.merge(df2, how="outer")
# df3

df4=pd.concat([df1,df2], axis=0)
df4

     Name Age Gender
0    Aman  34      M
1     Joy  31      M
2  Rashmi  22      F
3    Saif  33      M
0   Akhil  31      M
1    Asha  22      F
2  Preeti  23      F

**Appending columns in a dataframe**

In [18]:
# Another dataframe with same number of rows as df1
df3 = pd.DataFrame({'School': ['RK Public', 'JSP', 'Carmel Convent', 'St. Paul'],
                    'Graduation Marks': ['84', '89', '76', '91']})

df5=pd.concat([df1,df3],axis=1)
df5

     Name Age Gender          School Graduation Marks
0    Aman  34      M       RK Public               84
1     Joy  31      M             JSP               89
2  Rashmi  22      F  Carmel Convent               76
3    Saif  33      M        St. Paul               91

In [25]:
# Concatenating the dataframes: df1 and df3
df3=pd.concat([df1,df2])
df3("Age")

TypeError: 'DataFrame' object is not callable

In [43]:
# Concatenating the dataframes across column: df1 and df3
import numpy as np 
import pandas as pd
gold = pd.DataFrame({'Country': ['USA', 'France', 'Russia'],
                         'Medals': [15, 13, 9]}
                    )
silver = pd.DataFrame({'Country': ['USA', 'Germany', 'Russia'],
                        'Medals': [29, 20, 16]}
                    )
bronze = pd.DataFrame({'Country': ['France', 'USA', 'UK'],
                        'Medals': [40, 28, 27]})
gold.set_index("Country", inplace=True)
silver.set_index("Country", inplace=True)
bronze.set_index("Country", inplace=True)
total=gold.add(silver, axis=1, fill_value=0)
final=total.add(bronze,axis=1, fill_value=0)
final.sort_values(by="Medals", ascending=False)

         Medals
Country
USA        72.0
France     53.0
UK         27.0
Russia     25.0
Germany    20.0

In [59]:
import pandas as pd
sales=pd.read_excel("https://cdn.upgrad.com/UpGrad/temp/c4a16ce6-4048-4863-a6a1-d3cd02d63486/sales.xlsx", index_col="Region")
sales.loc[["Canada"]]

       Market  No_of_Orders   Profit     Sales
Region
Canada   USCA            49  7246.62  26298.81